app/controllers/wall_rental_requests_controller.rb

    def new
        @wall = Wall.all
---
SELECT "walls".* FROM "walls"

    def create
        @wallrentalrequest = WallRentalRequest.new(wall_rental_request_params)
        @wallrentalrequest.requester_id = current_user.id


        if @wallrentalrequest.save!
---
INSERT INTO "wall_rental_requests" ("wall_id", "start_date", "end_date", "created_at", "updated_at", "requester_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["wall_id", 4], ["start_date", "2020-10-06"], ["end_date", "2020-10-15"], ["created_at", "2020-10-06 20:44:34.084335"], ["updated_at", "2020-10-06 20:44:34.084335"], ["requester_id", 1]]

    def show
        @wallrentalrequest = WallRentalRequest.find_by(id: params[:id])
        @wall = Wall.find_by(id: @wallrentalrequest.wall_id)
---
SELECT  "wall_rental_requests".* FROM "wall_rental_requests" WHERE "wall_rental_requests"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT  "walls".* FROM "walls" WHERE "walls"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def approve
        wall_rental_request = WallRentalRequest.find_by(id: params[:id])
        wall_rental_request.approve!

        wall = Wall.find_by(id: wall_rental_request.wall.id)
---
SELECT  "wall_rental_requests".* FROM "wall_rental_requests" WHERE "wall_rental_requests"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "walls".* FROM "walls" WHERE "walls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def deny
        wall_rental_request = WallRentalRequest.find_by(id: params[:id])
        wall_rental_request.update!(status: "DENIED")

        wall = Wall.find_by(id: wall_rental_request.wall.id)
---
SELECT  "wall_rental_requests".* FROM "wall_rental_requests" WHERE "wall_rental_requests"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "wall_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "wall_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-09-04 01:30:58.755771"], ["id", 4]]
SELECT  "walls".* FROM "walls" WHERE "walls"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]