app/controllers/walls_controller.rb

    def index
        @walls = Wall.all
---
SELECT "walls".* FROM "walls"

    def show
        @wall = Wall.find_by(id: params[:id])
---
SELECT  "walls".* FROM "walls" WHERE "walls"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        @wall = current_user.walls.new(wall_params)

        if @wall.save!
---
INSERT INTO "walls" ("construction_date", "wall_material", "name", "description", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def edit
        @wall = current_user.walls.find_by(id: params[:id])
---
SELECT  "walls".* FROM "walls" WHERE "walls"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def update
        @wall = current_user.walls.find_by(id: params[:id])

        if @wall.update_attributes(wall_params)
---
SELECT  "walls".* FROM "walls" WHERE "walls"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "walls" SET "wall_material" = $1, "description" = $2, "updated_at" = $3 WHERE "walls"."id" = $4  [["wall_material", "clay"], ["description", "The wall is in a lovely neighborhood of mostly Irish immigrants\r\n"], ["updated_at", "2020-10-06 17:15:59.801781"], ["id", 2]]