app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "neka"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        # check username
        user = User.find_by(username: username)