app/models/wall_rental_request.rb

SELECT "wall_rental_requests".* FROM "wall_rental_requests" WHERE "wall_rental_requests"."id" != $1 AND "wall_rental_requests"."wall_id" = $2 AND NOT (start_date > '2020-05-01' OR end_date < '2020-04-01')  [["id", 1], ["wall_id", 1]]
---
    def overlapping_requests
        WallRentalRequest
            .where.not(id: self.id)
            .where(wall_id: wall_id)
            .where.not('start_date > :end_date OR end_date < :start_date',
                 start_date: start_date, end_date: end_date)

SELECT "wall_rental_requests".* FROM "wall_rental_requests" WHERE "wall_rental_requests"."id" != $1 AND "wall_rental_requests"."wall_id" = $2 AND NOT (start_date > '2020-10-06' OR end_date < '2020-10-04')  [["id", 10], ["wall_id", 3]]
---
    def overlapping_approved_requests
        array_of_requests = self.overlapping_requests
        approved_requests = []

        array_of_requests.each do |request|

SELECT "wall_rental_requests".* FROM "wall_rental_requests" WHERE "wall_rental_requests"."id" != $1 AND "wall_rental_requests"."wall_id" = $2 AND NOT (start_date > '2020-05-01' OR end_date < '2020-02-01')  [["id", 6], ["wall_id", 1]]
---
    def overlapping_pending_requests
        array_of_requests = self.overlapping_requests
        pending_requests = []

        array_of_requests.each do |request|

UPDATE "wall_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "wall_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-09-02 22:02:12.060581"], ["id", 5]]
UPDATE "wall_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "wall_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-10-13 18:07:21.357900"], ["id", 1]]
---
    def approve!
        transaction do
            self.update(status: "APPROVED")
            self.save!

            @pending_overlapping_requests_array = self.overlapping_pending_requests

            @pending_overlapping_requests_array.each do |request|
                request.update!(status: "DENIED")